"""
描述
用户输入两个数M和N，其中N是整数，计算M和N的5种数学运算结果，并依次输出，结果间用空格分隔。‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬

5种数学运算分别是：‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬

   M与N的和、M与N的乘积、M的N次幂、M除N的余数、M和N中较大的值‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬

本平台可以通过两次调用input()获得两个输入，示例代码如下：‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬
"""

#python 不以科学计数法输出
import numpy as np
np.set_printoptions(suppress=True)

a = eval(input())
b = eval(input())
#a = int(input())
#b = int(input())

sum = sum((a,b))
product = a*b
power = pow(a,b)
remainder = a%b
max = max(a,b)
print('{} {} {} {} {}'.format(sum,product,power,remainder,max))


#12 20 100 0 10
#1029.2 5121.0 1126999848051024.0 4.2000000000000455 1024.2
#991035916125874083964008999